class MainMenu:
    calculate_the_cost: str = "💴Рассчитать стоимость"
    about_delivery: str = "🗓️Узнать сроки доставки"
    rates: str = "💹Актуальный курс"
    make_order: str = "✨Сделать заказ✨"
    reviews: str = "💌Отзывы💌"
    instruction: str = "📜Инструкция для новичков📜"
    delivery_status: str = "👀Статус моего заказа"
    back_to_main_menu: str = "🏠На главную"
    main_menu: str = "<b>🏠Главное меню:</b>"
    my_orders: str = "📋Мои заказы"
    nearest_date: str = "🗓️Ближайшая дата отправки"
    
