class Misc:
    instruction_text = "<b>Небольшой гайд по Poizon:</b>"
    instruction_button_text = "🤓Что такое Poizon?"
    choose_type = "<b>Выберите товар:</b>"
    wrong = "🤖<i>Что-то пошло не так</i>"
    conversion_text = "💴<b>Введите сумму в ¥:</b>"
    reviews_and_link = "<b>Отзывы о нас:</b>\n" "https://t.me/crswrld_comment"
    rate = 13.4
    today_rate_text = (
        f"<b>Курс на сегодня составляет:\n\n"
        f"1¥ = {rate}₽</b>\n\n"
        "<i>(отличается от курса, который указан в интернете)</i>"
    )
    delivery_status_order = "🤔Посмотреть статус заказа"
    about_delivery = "<b>🌏Доставляем от 22 до 26 дней</b>"
    make_order_text = (
        "📌Для того, чтобы оформить заказ необходима следующая информация:\n\n"
        "📎ссылка на товар/скриншот товара\n\n"
        "📎размер\n\n"
        "📎цвет\n\n"
        "📎город получения заказа\n\n"
        "<b>Сделать заказ можно тут:</b>\n"
        "https://t.me/crswrld_manager"
    )
    welcome_text = (
        "Привет! Меня зовут Кроссик, рад тебя тут видеть, давай помогу тебе "
        "со всем разобраться🙌🏼\n\n"
        "📌Вот, что я могу:\n\n"
        "📎рассчитать стоимость товара по актуальному курсу;\n\n"
        "📎подсказать средние сроки доставки;\n\n"
        "📎сориентировать, где находится твоя посылка;\n\n"
        "📎оформить заказ.\n\n"
        "Переходи в меню, чтобы получить всю необходимую информацию и сделать заказ👟"
    )
